ThirdParty-v2012/swak4Foam-latest/Examples/tests/testFOExecution/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices        
(
    (-20.6 0 -0.5)
    (-20.6 3 -0.5)
    (-20.6 12.7 -0.5)
    (-20.6 25.4 -0.5)
    (0 -25.4 -0.5)
    (0 -5 -0.5)
    (0 0 -0.5)
    (0 3 -0.5)
    (0 12.7 -0.5)
    (0 25.4 -0.5)
    (206 -25.4 -0.5)
    (206 -8.5 -0.5)
    (206 0 -0.5)
    (206 6.5 -0.5)
    (206 17 -0.5)
    (206 25.4 -0.5)
    (290 -16.6 -0.5)
    (290 -6.3 -0.5)
    (290 0 -0.5)
    (290 4.5 -0.5)
    (290 11 -0.5)
    (290 16.6 -0.5)
    (-20.6 0 0.5)
    (-20.6 3 0.5)
    (-20.6 12.7 0.5)
    (-20.6 25.4 0.5)
    (0 -25.4 0.5)
    (0 -5 0.5)
    (0 0 0.5)
    (0 3 0.5)
    (0 12.7 0.5)
    (0 25.4 0.5)
    (206 -25.4 0.5)
    (206 -8.5 0.5)
    (206 0 0.5)
    (206 6.5 0.5)
    (206 17 0.5)
    (206 25.4 0.5)
    (290 -16.6 0.5)
    (290 -6.3 0.5)
    (290 0 0.5)
    (290 4.5 0.5)
    (290 11 0.5)
    (290 16.6 0.5)
);

blocks          
(
    hex (0 6 7 1 22 28 29 23) (18 7 1) simpleGrading (0.5 1.8 1)
    hex (1 7 8 2 23 29 30 24) (18 10 1) simpleGrading (0.5 4 1)
    hex (2 8 9 3 24 30 31 25) (18 13 1) simpleGrading (0.5 0.25 1)
    hex (4 10 11 5 26 32 33 27) center (180 18 1) simpleGrading (4 1 1)
    hex (5 11 12 6 27 33 34 28) center (180 9 1) edgeGrading (4 4 4 4 0.5 1 1 0.5 1 1 1 1)
    hex (6 12 13 7 28 34 35 29) center (180 7 1) edgeGrading (4 4 4 4 1.8 1 1 1.8 1 1 1 1)
    hex (7 13 14 8 29 35 36 30) center (180 10 1) edgeGrading (4 4 4 4 4 1 1 4 1 1 1 1)
    hex (8 14 15 9 30 36 37 31) center (180 13 1) simpleGrading (4 0.25 1)
    hex (10 16 17 11 32 38 39 33) (25 18 1) simpleGrading (2.5 1 1)
    hex (11 17 18 12 33 39 40 34) (25 9 1) simpleGrading (2.5 1 1)
    hex (12 18 19 13 34 40 41 35) (25 7 1) simpleGrading (2.5 1 1)
    hex (13 19 20 14 35 41 42 36) (25 10 1) simpleGrading (2.5 1 1)
    hex (14 20 21 15 36 42 43 37) (25 13 1) simpleGrading (2.5 0.25 1)
);

edges           
(
);

patches         
(
    patch inlet 
    (
        (0 22 23 1)
        (1 23 24 2)
        (2 24 25 3)
    )
    patch outlet 
    (
        (16 17 39 38)
        (17 18 40 39)
        (18 19 41 40)
        (19 20 42 41)
        (20 21 43 42)
    )
    wall upperWall 
    (
        (3 25 31 9)
        (9 31 37 15)
        (15 37 43 21)
    )
    wall lowerWall 
    (
        (0 6 28 22)
        (6 5 27 28)
        (5 4 26 27)
        (4 10 32 26)
        (10 16 38 32)
    )
    empty frontAndBack 
    (
        (22 28 29 23)
        (23 29 30 24)
        (24 30 31 25)
        (26 32 33 27)
        (27 33 34 28)
        (28 34 35 29)
        (29 35 36 30)
        (30 36 37 31)
        (32 38 39 33)
        (33 39 40 34)
        (34 40 41 35)
        (35 41 42 36)
        (36 42 43 37)
        (0 1 7 6)
        (1 2 8 7)
        (2 3 9 8)
        (4 5 11 10)
        (5 6 12 11)
        (6 7 13 12)
        (7 8 14 13)
        (8 9 15 14)
        (10 11 17 16)
        (11 12 18 17)
        (12 13 19 18)
        (13 14 20 19)
        (14 15 21 20)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
