ThirdParty-v2012/swak4Foam-latest/Examples/tests/testFOExecution/0.org/scalar
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      scalar;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    inlet
    {
        type            groovyBC;
        valueExpression "cos(2*pi*time()/0.005)<0 ? 1 : 0";
        value uniform 0;
    }
    outlet
    {
        type            inletOutlet;
        value uniform 0;
        inletValue uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }

    ".+"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
